.config/emacs/init.org
** Modus Themes
:PROPERTIES:
:header-args:emacs-lisp: :tangle "jp-emacs-modules/jp-emacs-modus-themes.el"
:END:

Configuration for the Modus themes.

#+begin_src emacs-lisp
;;; The Modus themes

;; The themes are highly customisable.  Read the manual:
;; <https://protesilaos.com/emacs/modus-themes>.
(jp-emacs-configure
  (jp-emacs-install modus-themes)
  ;; Starting with version 5.0.0 of the `modus-themes', other packages
  ;; can be built on top to provide their own "Modus" derivatives.
  ;; For example, this is what I do with my `ef-themes' and
  ;; `standard-themes' (starting with versions 2.0.0 and 3.0.0,
  ;; respectively).
  ;;
  ;; The `modus-themes-include-derivatives-mode' makes all Modus
  ;; commands that act on a theme consider all such derivatives, if
  ;; their respective packages are available and have been loaded.
  ;;
  ;; Note that those packages can even completely take over from the
  ;; Modus themes such that, for example, `modus-themes-rotate' only
  ;; goes through the Ef themes (to this end, the Ef themes provide
  ;; the `ef-themes-take-over-modus-themes-mode' and the Standard
  ;; themes have the `standard-themes-take-over-modus-themes-mode'
  ;; equivalent).
  ;;
  ;; If you only care about the Modus themes, then (i) you do not need
  ;; to enable the `modus-themes-include-derivatives-mode' and (ii) do
  ;; not install and activate those other theme packages.
  (modus-themes-include-derivatives-mode 1)

  (jp-emacs-keybind global-map
    "<f5>" #'modus-themes-rotate
    "C-<f5>" #'modus-themes-select
    "M-<f5>" #'modus-themes-load-random)

  (setq modus-themes-mixed-fonts t
        modus-themes-variable-pitch-ui t
        modus-themes-italic-constructs t
        modus-themes-bold-constructs t
        modus-themes-completions '((t . (bold)))
        modus-themes-prompts '(bold)
        modus-themes-headings
        '((agenda-structure . (variable-pitch light 2.2))
          (agenda-date . (variable-pitch regular 1.3))
          (t . (regular 1.15))))

  (setq modus-themes-common-palette-overrides nil)

  (if (jp-emacs-gnome-prefers-dark-p)
      (modus-themes-load-random 'dark)
    (modus-themes-load-random 'light)))

;; NOTE: For testing purposes
(jp-emacs-comment
  (:eval nil)

  (add-to-list 'load-path "~/Git/Projects/modus-themes/")

  (require 'modus-themes)

  (modus-themes-include-derivatives-mode 1)

  (jp-emacs-keybind global-map
    "<f5>" #'modus-themes-rotate
    "C-<f5>" #'modus-themes-select
    "M-<f5>" #'modus-themes-load-random)

  (if (jp-emacs-gnome-prefers-dark-p)
      (modus-themes-load-random 'dark)
    (modus-themes-load-random 'light)))

(provide 'jp-emacs-modus-themes)
#+end_src

** Mu4e
:PROPERTIES:
:header-args:emacs-lisp: :tangle "jp-emacs-modules/jp-emacs-mu4e.el"
:END:

Mu4e email client configuration with mbsync, mu4e-alert, and org-contacts.

#+begin_src emacs-lisp
;;; jp-emacs-mu4e.el --- mu4e configuration -*- lexical-binding: t; -*-

(jp-emacs-configure
  (require 'mu4e)

;;;; Mail sync
  (setq mu4e-get-mail-command "mbsync -a")
  (setq mu4e-update-interval (* 10 60))

;;;; Maildir
  (setq mu4e-maildir (expand-file-name "~/Mail"))

  (setq mu4e-contacts-file "~/Documents/Emacs/org/agenda/contacts.org")

  ;; Autocompletado para org-contacts file
  (setq mu4e-compose-complete-addresses nil)

;;;; Identity
  (setq user-mail-address "jpacheco@disroot.org"
        user-full-name    "Javier Pacheco")

;;;; Sending mail (msmtp)
  (setq sendmail-program "msmtp"
        send-mail-function 'sendmail-send-it
        message-send-mail-function 'sendmail-send-it)

;;;; SMTP (fallback)
  (setq smtpmail-smtp-server  "disroot.org"
        smtpmail-smtp-service 587
        smtpmail-stream-type  'starttls
        smtpmail-smtp-user    "jpacheco@disroot.org")

;;;; Composition
  (setq mu4e-compose-dont-reply-to-self t)
  (setq mu4e-compose-keep-self-cc nil)
  (setq message-kill-buffer-on-exit t)

;;;; Important for mbsync
  (setq mu4e-change-filenames-when-moving t)

;;;; Visual
  (setq mu4e-view-show-images t)
  (setq mu4e-view-show-addresses t)

;;;; Mail folders
  (setq mu4e-maildir "/disroot"
        mu4e-drafts-folder  "/disroot/Drafts"
        mu4e-sent-folder    "/disroot/Sent"
        mu4e-refile-folder  "/disroot/Archive"
        mu4e-trash-folder   "/disroot/Trash")

;;;; Inbox query
  (setq m/mu4e-inbox-query
        "(maildir:/disroot/INBOX) AND flag:unread")

;;;; Shortcuts
  (setq mu4e-maildir-shortcuts
        '((:maildir "/disroot/INBOX"  :key ?i)
          (:maildir "/disroot/Sent"   :key ?s)
          (:maildir "/disroot/Trash"  :key ?t)
          (:maildir "/disroot/Drafts" :key ?d)))

;;;; Bookmarks
  (setq mu4e-bookmarks
        '((:name "Unread messages"
                 :query "flag:unread AND NOT flag:trashed"
                 :key ?i)

          (:name "Today's messages"
                 :query "date:today..now"
                 :key ?t)

          (:name "Last 7 days"
                 :query "date:7d..now"
                 :hide-unread t
                 :key ?w)

          (:name "Messages with images"
                 :query "mime:image/*"
                 :key ?p)))

;;;; Quick inbox
  (defun jp/mu4e-go-to-inbox ()
    (interactive)
    (mu4e-headers-search m/mu4e-inbox-query))

  (defun jp/mu4e-direct-inbox ()
    "Abrir el Inbox de Disroot directamente en la ventana actual."
    (interactive)
    ;; Esta función salta directamente a los encabezados con el query de tu inbox
    (mu4e-headers-search "maildir:/disroot/INBOX"))

;;;; Keybindings
  (jp-emacs-keybind global-map
    "C-c m" #'mu4e
    "C-x m" #'mu4e-compose-new)

;;;; Modeline
  (setq mu4e-modeline-support nil)

;;;; General settings
  (setq mu4e-confirm-quit nil))

;;; Mu4e Alert
(jp-emacs-configure
  (jp-emacs-install mu4e-alert)

  (require 'mu4e-alert)

  ;; estilo de notificación
  (setq mu4e-alert-style 'notifications)

  ;; activar notificaciones
  (mu4e-alert-enable-notifications)

  ;; actualizar correo automáticamente
  (setq mu4e-update-interval 300) ;; 5 minutos
  (mu4e-alert-enable-mode-line-display)

  ;; 1. Define la consulta para los mensajes no leídos (solo INBOX)
  (setq mu4e-alert-interesting-query "flag:unread AND maildir:/disroot/INBOX")

  ;; 2. Personaliza el formato de la mode-line
  ;; Usamos el icono de la bandeja de entrada y el formato que pediste
  (setq mu4e-alert-modeline-formatter
        (lambda (count)
          (if (> count 0)
              "📥"   ; Solo el icono si hay 1 o más
            "")))     ; Nada si está vacío

  ;; 3. Asegúrate de que el refresco sea constante
  (mu4e-alert-enable-mode-line-display))

;;; Org-contacts
(jp-emacs-configure
  (jp-emacs-install org-contacts)
  (require 'org-contacts)

  (setq org-contacts-files '("~/Documents/Emacs/org/agenda/contacts.org"))

  (add-to-list 'mu4e-headers-actions
               '("org-contact-add" . mu4e-action-add-org-contact) t)
  (add-to-list 'mu4e-view-actions
               '("org-contact-add" . mu4e-action-add-org-contact) t)

  ;; Backend de autocompletado
  (setq mu4e-compose-complete-addresses-function #'mu4e--compose-complete-handler)
  (add-to-list 'completion-at-point-functions #'org-contacts-message-complete-function))

  (jp-emacs-configure
    (mu4e-modeline-mode 1)
    ;; Si quieres que solo te avise de los correos en el INBOX:
    (setq mu4e-modeline-unread-items-query "flag:unread AND maildir:/disroot/INBOX"))

(provide 'jp-emacs-mu4e)
#+end_src

