.config/emacs/init.org
** Pixel Themes
:PROPERTIES:
:header-args:emacs-lisp: :tangle "jp-emacs-modules/jp-emacs-pixel-themes.el"
:END:

Configuration for the Pixel themes.

#+begin_src emacs-lisp
;;; The Pixel themes

(jp-emacs-configure
  (jp-emacs-install pixel-themes "https://github.com/lucasobx/pixel-themes")

  (load-theme 'pixel-themes-miri16))

(provide 'jp-emacs-pixel-themes)
#+end_src

** Search
:PROPERTIES:
:header-args:emacs-lisp: :tangle "jp-emacs-modules/jp-emacs-search.el"
:END:

Isearch, occur, grep, xref, and wgrep configuration.

#+begin_src emacs-lisp
;;; Isearch, occur, grep, and extras (jp-search.el)
(jp-emacs-configure
 (setq search-whitespace-regexp ".*?")
 (setq isearch-lax-whitespace t)
 (setq isearch-regexp-lax-whitespace nil))

(jp-emacs-configure
  (setq search-highlight t)
  (setq isearch-lazy-highlight t)
  (setq lazy-highlight-initial-delay 0.5)
  (setq lazy-highlight-no-delay-length 4))

(jp-emacs-configure
  (setq isearch-lazy-count t)
  (setq lazy-count-prefix-format "(%s/%s) ")
  (setq lazy-count-suffix-format nil))

(jp-emacs-configure
  (setq isearch-wrap-pause t) ; `no-ding' makes keyboard macros never quit
  (setq isearch-repeat-on-direction-change t))

(jp-emacs-configure
 (setq list-matching-lines-jump-to-current-line nil) ; do not jump to current line in `*occur*' buffers
 (jp-emacs-hook occur-mode-hook (jp-common-truncate-lines-silently hl-line-mode)))

(jp-emacs-configure
 (define-key global-map (kbd "C-.") #'isearch-forward-symbol-at-point) ; easier than M-s . // I also have `jp-simple-mark-sexp' on C-,
 (define-key minibuffer-local-isearch-map (kbd "M-/") #'isearch-complete-edit)
 (define-key occur-mode-map (kbd "t") #'toggle-truncate-lines)
 (jp-emacs-keybind isearch-mode-map
   "C-g" #'isearch-cancel ; instead of `isearch-abort'
   "M-/" #'isearch-complete))

(jp-emacs-configure
 (require 'jp-search)
 (jp-emacs-keybind global-map
   "M-s M-%" #'jp-search-replace-markup ; see `jp-search-markup-replacements'
   "M-s M-<" #'jp-search-isearch-beginning-of-buffer
   "M-s M->" #'jp-search-isearch-end-of-buffer
   "M-s g" #'jp-search-grep
   "M-s u" #'jp-search-occur-urls
   "M-s t" #'jp-search-occur-todo-keywords
   "M-s M-t" #'jp-search-grep-todo-keywords ; With C-u it runs `jp-search-git-grep-todo-keywords'
   "M-s M-T" #'jp-search-git-grep-todo-keywords
   "M-s s" #'jp-search-outline
   "M-s M-o" #'jp-search-occur-outline
   "M-s M-u" #'jp-search-occur-browse-url)
 (jp-emacs-keybind isearch-mode-map
   "<up>" #'jp-search-isearch-repeat-backward
   "<down>" #'jp-search-isearch-repeat-forward
   "<backspace>" #'jp-search-isearch-abort-dwim
   "<C-return>" #'jp-search-isearch-other-end)
 (setq jp-search-outline-regexp-alist
       '((emacs-lisp-mode . "^\\((\\|;;;+ \\)")
         (org-mode . "^\\(\\*+ +\\|#\\+[Tt][Ii][Tt][Ll][Ee]:\\)")
         (outline-mode . "^\\*+ +")
         (emacs-news-view-mode . "^\\*+ +")
         (conf-toml-mode . "^\\[")
         (markdown-mode . "^#+ +")))
 (setq jp-search-todo-keywords
       (concat "TODO\\|FIXME\\|NOTE\\|REVIEW\\|XXX\\|KLUDGE"
               "\\|HACK\\|WARN\\|WARNING\\|DEPRECATED\\|BUG"))

 (jp-emacs-hook
   jp-search-outline-hook
   (pulsar-recenter-center pulsar-reveal-entry)
   nil
   pulsar))

;;; grep and xref
(jp-emacs-configure
  (setq reb-re-syntax 'read)

  (let ((ripgrep (or (executable-find "rg") (executable-find "ripgrep"))))
    ;; All those have been changed for Emacs 28
    (setq xref-show-definitions-function #'xref-show-definitions-completing-read) ; for M-.
    (setq xref-show-xrefs-function #'xref-show-definitions-buffer) ; for grep and the like
    (setq xref-file-name-display 'project-relative)
    (setq xref-search-program (if ripgrep 'ripgrep 'grep))

    (setq grep-save-buffers nil)
    (setq grep-use-headings nil) ; Emacs 30

    (setq grep-program (or ripgrep (executable-find "grep")))
    (setq grep-template
          (if ripgrep
              "/usr/bin/rg -nH --null -e <R> <F>"
            "/usr/bin/grep <X> <C> -nH --null -e <R> <F>")))

  (add-hook 'grep-mode #'jp-common-truncate-lines-silently))

;;; wgrep (writable grep)
;; See the `grep-edit-mode' for the new built-in feature.
(unless (>= emacs-major-version 31)
  (jp-emacs-configure
    (jp-emacs-install wgrep)
    (with-eval-after-load 'grep
      (jp-emacs-keybind grep-mode-map
        "e" #'wgrep-change-to-wgrep-mode
        "C-x C-q" #'wgrep-change-to-wgrep-mode
        "C-c C-c" #'wgrep-finish-edit)
      (setq wgrep-auto-save-buffer t)
      (setq wgrep-change-readonly-file t))))

(provide 'jp-emacs-search)
#+end_src

** Spell
:PROPERTIES:
:header-args:emacs-lisp: :tangle "jp-emacs-modules/jp-emacs-spell.el"
:END:

Spell checking with hunspell and jinx.

#+begin_src emacs-lisp
(jp-emacs-configure

  ;;========================
  ;; Hunspell / Dictionaries
  ;;========================

  (setq ispell-program-name "hunspell")

  (setq ispell-hunspell-dict-paths-alist
        '(("en_US" "~/.dotfiles/.emacs.d/lang/en_US.aff")
          ("es_MX" "~/.dotfiles/.emacs.d/lang/es_MX.aff")))

  (setq ispell-local-dictionary-alist
        '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil nil nil utf-8)
          ("es_MX" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil nil nil utf-8)))

  (setq ispell-local-dictionary "en_US")

  (defvar jp/ispell-current-dictionary "en_US")

  (defun jp/toggle-ispell-dictionary ()
    "Toggle between English and Spanish hunspell dictionaries."
    (interactive)
    (if (string= jp/ispell-current-dictionary "en_US")
        (progn
          (setq jp/ispell-current-dictionary "es_MX")
          (message "Switched to Spanish dictionary"))
      (progn
        (setq jp/ispell-current-dictionary "en_US")
        (message "Switched to English dictionary")))
    (ispell-change-dictionary jp/ispell-current-dictionary))


  ;;========================
  ;; Jinx spell checker
  ;;========================

  (jp-emacs-install jinx)

  (require 'jinx)

  (dolist (hook '(text-mode-hook conf-mode-hook))
    (add-hook hook #'jinx-mode))

  (global-set-key (kbd "M-;") #'jinx-correct))
  ;; (global-set-key (kbd "<f8>") #'jinx-languages))

(provide 'jp-emacs-spell)
#+end_src

** Standard Themes
:PROPERTIES:
:header-args:emacs-lisp: :tangle "jp-emacs-modules/jp-emacs-standard-themes.el"
:END:

Configuration for the Standard themes.

#+begin_src emacs-lisp
;;; The Standard themes

(jp-emacs-configure
  (jp-emacs-install standard-themes)

  (standard-themes-take-over-modus-themes-mode 1)

  (jp-emacs-keybind global-map
    "<f5>" #'modus-themes-rotate
    "C-<f5>" #'modus-themes-select
    "M-<f5>" #'modus-themes-load-random)

  (setq modus-themes-variable-pitch-ui t
        modus-themes-mixed-fonts t
        modus-themes-to-rotate nil ; defaults to the return value of `modus-themes-get-themes'
        modus-themes-headings ; read the manual's entry of the doc string
        '((0 . (variable-pitch light 1.9))
          (1 . (variable-pitch light 1.8))
          (2 . (variable-pitch regular 1.7))
          (3 . (variable-pitch regular 1.6))
          (4 . (variable-pitch regular 1.5))
          (5 . (variable-pitch 1.4)) ; absence of weight means `bold'
          (6 . (variable-pitch 1.3))
          (7 . (variable-pitch 1.2))
          (agenda-date . (semilight 1.5))
          (agenda-structure . (variable-pitch light 1.9))
          (t . (variable-pitch 1.1))))

  ;; The `standard-themes' provide lots of themes.  I want to pick one at
  ;; random when I start Emacs: the `modus-themes-load-random' does just
  ;; that (it can be called interactively as well).  I just check with
  ;; my desktop environment to determine if the choice should be about
  ;; a light or a dark theme.  Those functions are in my init.el.
  (if (jp-emacs-gnome-prefers-dark-p)
      (modus-themes-load-random 'dark)
    (modus-themes-load-random 'light)))

;; For testing purposes...
(jp-emacs-comment
  (:eval nil)

  (add-to-list 'load-path "~/Git/Projects/modus-themes/")
  (add-to-list 'load-path "~/Git/Projects/standard-themes/")

  (require 'modus-themes)
  (require 'standard-themes)

  (standard-themes-take-over-modus-themes-mode 1)

  (jp-emacs-keybind global-map
    "<f5>" #'modus-themes-rotate
    "C-<f5>" #'modus-themes-select
    "M-<f5>" #'modus-themes-load-random)

  (if (jp-emacs-gnome-prefers-dark-p)
      (modus-themes-load-random 'dark)
    (modus-themes-load-random 'light)))

(provide 'jp-emacs-standard-themes)
#+end_src

** Telega
:PROPERTIES:
:header-args:emacs-lisp: :tangle "jp-emacs-modules/jp-emacs-telega.el"
:END:

Telegram client configuration using telega.el.

#+begin_src emacs-lisp
(jp-emacs-configure
  (jp-emacs-install telega)

  (require 'telega)
  (setq telega-chat-input-markups '("org" "markdown2" nil))
  
  (setq telega-completing-read-function #'completing-read)
  
  (define-key telega-chat-mode-map (kbd "S-<return>") #'newline)
  
  (with-eval-after-load 'telega
    (define-key telega-msg-button-map (kbd "l") nil))
  
  (add-hook 'telega-chat-mode-hook
            (lambda ()
              (setq-local show-trailing-whitespace nil))))

(defun my/start-telega ()
  "Start `telega' inside a new perspective and activate 'telega-mode-line-mode'"
  (interactive)
  (if (fboundp 'persp-switch)
      (persp-switch "*telega*")
    (switch-to-buffer "*telega*"))
  (telega)
  (telega-mode-line-mode))

(provide 'jp-emacs-telega)
#+end_src

