.config/emacs/init.org
** Vertico
:PROPERTIES:
:header-args:emacs-lisp: :tangle "jp-emacs-modules/jp-emacs-vertico.el"
:END:

Vertical completion layout using Vertico.

#+begin_src emacs-lisp
;;; Vertical completion layout (vertico)
(jp-emacs-configure
  (jp-emacs-install vertico)

  (setq vertico-scroll-margin 0)
  (setq vertico-count 5)
  (setq vertico-resize t)
  (setq vertico-cycle t)

  (with-eval-after-load 'rfn-eshadow
    ;; This works with `file-name-shadow-mode' enabled.  When you are in
    ;; a sub-directory and use, say, `find-file' to go to your home '~/'
    ;; or root '/' directory, Vertico will clear the old path to keep
    ;; only your current input.
    (add-hook 'rfn-eshadow-update-overlay-hook #'vertico-directory-tidy))

  (setq vertico-group-format
        (concat
         (propertize (make-string 20 ? ) 'face 'completions-group-separator)
         (propertize " %s " 'face 'completions-group-title)
         (propertize " " 'face 'completions-group-separator 'display '(space :align-to right))))

  (vertico-mode 1))

  ;; (jp-emacs-keybind vertico-map
  ;;   "TAB" #'vertico-next
  ;;   "<backtab>" #'vertico-previous)

(provide 'jp-emacs-vertico)
#+end_src

** Web
:PROPERTIES:
:header-args:emacs-lisp: :tangle "jp-emacs-modules/jp-emacs-web.el"
:END:

Web browsing configuration including browse-url, eww, elfeed, and rcirc.

#+begin_src emacs-lisp
;;;; `browse-url'
(jp-emacs-configure
  (setq browse-url-browser-function 'eww-browse-url)
  (setq browse-url-secondary-browser-function 'browse-url-default-browser))

;;;; `goto-addr'
(jp-emacs-configure
  (add-hook 'text-mode-hook #'goto-address-mode)
  (add-hook 'prog-mode-hook #'goto-address-prog-mode)
  (setq goto-address-url-face 'link)
  (setq goto-address-url-mouse-face 'highlight)
  (setq goto-address-mail-face nil)
  (setq goto-address-mail-mouse-face 'highlight))

;;;; `shr' (Simple HTML Renderer)
(jp-emacs-configure
  (setq shr-use-colors nil)             ; t is bad for accessibility
  (setq shr-use-fonts nil)              ; t is superfluous, given `variable-pitch-mode'
  (setq shr-max-image-proportion 0.6)
  (setq shr-image-animate nil)          ; No GIFs, thank you!
  (setq shr-width fill-column)
  (setq shr-max-width fill-column)
  (setq shr-discard-aria-hidden t)
  (setq shr-fill-text nil)              ; Emacs 31
  (setq shr-cookie-policy nil))

;;;; `url-cookie'
(jp-emacs-configure
  (setq url-cookie-untrusted-urls '(".*")))

;;;; `eww' (Emacs Web Wowser)
(jp-emacs-configure
  (with-eval-after-load 'eww
    (autoload #'jp-simple-buffers-major-mode "jp-simple")

    (jp-emacs-keybind eww-mode-map
      "S" nil ; unmap `eww-list-buffers'
      "b" #'jp-simple-buffers-major-mode ; a general version to show buffer of current mode
      "m" #'bookmark-set)

    (define-key eww-link-keymap (kbd "v")  nil) ; stop overriding `eww-view-source'

    (with-eval-after-load 'dired
      (define-key dired-mode-map (kbd "E") #'eww-open-file)) ; to render local HTML files

    (setq eww-auto-rename-buffer 'title)
    (setq eww-header-line-format nil)
    (setq eww-bookmarks-directory (locate-user-emacs-file "eww-bookmarks/"))
    (setq eww-history-limit 150)
    (setq eww-use-external-browser-for-content-type
          "\\`\\(video/\\|audio\\)") ; On GNU/Linux check your mimeapps.list
    (setq eww-form-checkbox-selected-symbol "[X]")
    (setq eww-form-checkbox-symbol "[ ]")
    ;; NOTE `eww-retrieve-command' is for Emacs28.  I tried the following
    ;; two values.  The first would not render properly some plain text
    ;; pages, such as by messing up the spacing between paragraphs.  The
    ;; second is more reliable but feels slower.  So I just use the
    ;; default (nil), though I find wget to be a bit faster.  In that case
    ;; one could live with the occasional errors by using `eww-download'
    ;; on the offending page, but I prefer consistency.
    ;;
    ;; '("wget" "--quiet" "--output-document=-")
    ;; '("chromium" "--headless" "--dump-dom")
    (setq eww-retrieve-command nil)

    ;; NOTE 2025-02-15: Emacs has a robust framework for writing
    ;; bookmarks, which `eww' supports.  Though `eww' also defines its
    ;; own parallel bookmark data, which I do not want to use.  So here
    ;; I disable all the relevant commands.
    (dolist (command '( eww-list-bookmarks eww-add-bookmark eww-bookmark-mode
                        eww-list-buffers eww-toggle-fonts eww-toggle-colors
                        eww-switch-to-buffer))
      (put command 'disabled t))))

;;;; `jp-eww' extras
(jp-emacs-configure
  (with-eval-after-load 'eww
    (require 'jp-eww)
    (jp-emacs-keybind eww-mode-map
      "F" #'jp-eww-find-feed
      "o" #'jp-eww-open-in-other-window
      "j" #'jp-eww-jump-to-url-on-page
      "J" #'jp-eww-visit-url-on-page)))

;;; Elfeed feed/RSS reader
(jp-emacs-configure
  (jp-emacs-install elfeed)

  (define-key global-map (kbd "C-c e") #'elfeed)

  (with-eval-after-load 'elfeed

    (add-hook 'elfeed-show-mode-hook #'visual-line-mode)

    (jp-emacs-keybind elfeed-search-mode-map
      "w" #'elfeed-search-yank
      "g" #'elfeed-update
      "G" #'elfeed-search-update--force)

    (define-key elfeed-show-mode-map (kbd "w") #'elfeed-show-yank)

    (setq elfeed-use-curl nil)
    (setq elfeed-curl-max-connections 10)
    (setq elfeed-db-directory (expand-file-name "elfeed/" user-emacs-directory))
    (setq elfeed-enclosure-default-dir (expand-file-name "~/Downloads/"))
    (setq elfeed-search-filter "@2-weeks-ago +unread")
    (setq elfeed-sort-order 'descending)
    (setq elfeed-search-clipboard-type 'CLIPBOARD)
    (setq elfeed-search-title-max-width 100)
    (setq elfeed-search-title-min-width 30)
    (setq elfeed-search-trailing-width 25)
    (setq elfeed-show-truncate-long-urls t)
    (setq elfeed-show-unique-buffers t)
    (setq elfeed-search-date-format '("%F %R" 20 :left))
    ;; NOTE 2025-10-28: Instead of showing my `elfeed-feeds' here, I put
    ;; it in its own Emacs Lisp file.  The `load' function will evaluate
    ;; that code.  Internally, the file has just the following:
    ;;
    ;;     (setq elfeed-feeds FEEDS)
    ;; (unless (bound-and-true-p elfeed-feeds)
    ;;   (load (expand-file-name "~/.config/emacs/feeds.el.gpg") :no-error :no-message))
    ;; Make entries tagged as "personal" use the `bold-italic' face.
    ;; This way I can quickly notice my own entries in the listing.
    (add-to-list 'elfeed-search-face-alist '(personal bold-italic))))

;;; Elfeed-org

(jp-emacs-configure
  (jp-emacs-install elfeed-org)

  (require 'elfeed-org)
  ;; is started with =M-x elfeed=
  (elfeed-org)

  ;; Optionally specify a number of files containing elfeed
  ;; configuration. If not set then the location below is used.
  (setq rmh-elfeed-org-files (list "~/.config/emacs/feeds.org")))


;;; Rcirc (IRC client)
(jp-emacs-configure
  (with-eval-after-load 'rcirc
    (setq rcirc-server-alist
          `(("irc.libera.chat"
             :channels ("#emacs")
             :port 6697
             :encryption tls
             :password ,(jp-common-auth-get-field "libera" :secret))))

    (setq rcirc-prompt "%t> ") ; Read the docs or use (customize-set-variable 'rcirc-prompt "%t> ")

    (setq rcirc-default-nick "jpachecoxyz"
          rcirc-default-user-name "jpachecoxyz"
          rcirc-default-full-name "Javier Pacheco")

    ;; ;; NOTE 2021-11-28: demo from the days of EmacsConf 2021.  I don't
    ;; ;; actually need this.
    ;; (setq rcirc-bright-nicks '("bandali" "sachac" "zaeph"))

    ;; NOTE 2021-11-28: Is there a canonical way to disable this?
    (setq rcirc-timeout-seconds most-positive-fixnum)

    (rcirc-track-minor-mode 1)))

(provide 'jp-emacs-web)
#+end_src

** Which Key
:PROPERTIES:
:header-args:emacs-lisp: :tangle "jp-emacs-modules/jp-emacs-which-key.el"
:END:

Which-key configuration for showing available keybindings.

#+begin_src emacs-lisp
(jp-emacs-configure
  (setq which-key-separator "  ")
  (setq which-key-prefix-prefix "... ")
  (setq which-key-max-display-columns 3)
  (setq which-key-idle-delay 1.5)
  (setq which-key-idle-secondary-delay 0.25)
  (setq which-key-add-column-padding 1)
  (setq which-key-max-description-length 40)

  (which-key-mode 1)) ; built into Emacs 30

(provide 'jp-emacs-which-key)
#+end_src

